{
  "backend/main.mo": "Motoko canister defining Child, Letter, and Photo records with add/get functions and in‑memory maps plus sorted photo queries.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON-style listing summarizing each frontend file’s purpose within the Valentine-themed app.",
  "frontend/index.css": "Tailwind base styles defining color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component orchestrating sections, theme behavior, persisted state usage, and lightbox rendering.",
  "frontend/src/components/valentine/AnimatedLetterReveal.tsx": "Component that progressively reveals letter text unless reduced‑motion is enabled.",
  "frontend/src/components/valentine/CustomizationPanel.tsx": "Panel for editing personalization fields, generating share links, and resetting local browser‑stored data.",
  "frontend/src/components/valentine/DetailsSection.tsx": "Shows date, place, and note details if provided; otherwise displays a prompt to add them.",
  "frontend/src/components/valentine/FloatingAccents.tsx": "Renders floating decorative icons unless reduced-motion mode is enabled.",
  "frontend/src/components/valentine/FlowNav.tsx": "Provides a bottom navigation bar to switch between main love-letter sections.",
  "frontend/src/components/valentine/GallerySection.tsx": "Displays uploaded photos with captions and deletion controls, plus an uploader and info alert.",
  "frontend/src/components/valentine/IntroSection.tsx": "Shows intro names with heart icon and buttons to reveal or customize the page.",
  "frontend/src/components/valentine/LetterSection.tsx": "Allows previewing and editing of the love letter, including template selection and animated reveal.",
  "frontend/src/components/valentine/LightboxDialog.tsx": "Full-screen photo viewer with navigation, close controls, captions, and index display.",
  "frontend/src/components/valentine/PhotoUploader.tsx": "Handles image uploads with validation and adds them to the photo gallery.",
  "frontend/src/components/valentine/ReduceMotionToggle.tsx": "Toggle switch to enable or disable reduced-motion mode.",
  "frontend/src/components/valentine/RevealSection.tsx": "Animated reveal of the headline with buttons to access the letter or gallery.",
  "frontend/src/components/valentine/SectionShell.tsx": "Simple wrapper adding transition styling around section content.",
  "frontend/src/components/valentine/ThemeOrnaments.tsx": "Applies background patterns and ornamental frames as decorative visuals.",
  "frontend/src/content/islamicLetterTemplates.ts": "Exports an array of Islamic-themed romantic letter templates with titles and content strings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, updating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identities, and status management.",
  "frontend/src/hooks/useQueries.ts": "Provides example React Query hooks using the backend actor, including a photo-fetching query.",
  "frontend/src/hooks/useReducedMotion.ts": "Zustand store and hook detecting system reduced‑motion preference and updating state accordingly.",
  "frontend/src/hooks/useShareLink.ts": "Generates and copies shareable URLs based on user config, with copy status and toast feedback.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, animations, and font imports for the UI theme.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/state/useLoveLetterConfig.ts": "Zustand store with persistence for managing love letter fields, templates, and UI section state.",
  "frontend/src/state/usePhotoGallery.ts": "Zustand store for managing photo gallery items, captions, and the active photo with persistence.",
  "frontend/src/utils/shareQueryParams.ts": "Parses share-related query params and generates clean share URLs with from/to values.",
  "frontend/tailwind.config.js": "Tailwind configuration customizing colors, fonts, containers, animations, and theme extensions.",
  "project_state.json": "Contains project metadata, feature list, issues, and architectural notes for building a customizable Valentine-style webpage. It outlines current capabilities, known problems, and design requirements for further development."
}