{
  "backend/main.mo": "Motoko canister storing children, letters, and photos with add/get methods and sortable photo queries.",
  "feature_evidence.json": "Feature evidence report listing two Indonesian‑localization features and their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten map of frontend file paths to short human‑readable summaries used for reference.",
  "frontend/index.css": "Tailwind base/theme CSS defining light and dark color tokens and global styling rules.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app orchestrating theme, sections, navigation, share‑param parsing, and lightbox rendering.",
  "frontend/src/components/valentine/AnimatedLetterReveal.tsx": "Component animating letter text reveal character‑by‑character unless reduced‑motion is enabled.",
  "frontend/src/components/valentine/CustomizationPanel.tsx": "Customization form for editing names, headline, details, notes, and generating share links.",
  "frontend/src/components/valentine/DetailsSection.tsx": "Displays optional date, place, and note cards or a fallback message if no details exist.",
  "frontend/src/components/valentine/FloatingAccents.tsx": "Renders floating decorative accent images unless reduced-motion is enabled.",
  "frontend/src/components/valentine/FlowNav.tsx": "Provides a bottom navigation bar for switching between app sections.",
  "frontend/src/components/valentine/GallerySection.tsx": "Displays an uploaded photo gallery with removal and lightbox activation.",
  "frontend/src/components/valentine/IntroSection.tsx": "Shows the intro screen with names and buttons to reveal or customize the page.",
  "frontend/src/components/valentine/LetterSection.tsx": "Handles previewing and editing love letters with selectable templates.",
  "frontend/src/components/valentine/LightboxDialog.tsx": "Full-screen photo lightbox with navigation and captions.",
  "frontend/src/components/valentine/PhotoUploader.tsx": "Uploads images with type and size validation and adds them to the gallery.",
  "frontend/src/components/valentine/ReduceMotionToggle.tsx": "Toggle switch to enable or disable reduced-motion mode.",
  "frontend/src/components/valentine/RevealSection.tsx": "Animated reveal screen showing the headline and navigation to letter or gallery.",
  "frontend/src/components/valentine/SectionShell.tsx": "Wrapper component adding a transition container around its children.",
  "frontend/src/components/valentine/ThemeOrnaments.tsx": "Renders background patterns and ornamental frames for page styling.",
  "frontend/src/content/islamicLetterTemplates.ts": "Provides predefined Islamic-themed love letter templates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, wrapping AuthClient setup and exposing login state and identity.",
  "frontend/src/hooks/useQueries.ts": "Defines a sample React Query hook that fetches all photos via an actor if available.",
  "frontend/src/hooks/useReducedMotion.ts": "Implements a Zustand store and hook to track and respond to system reduced‑motion preferences.",
  "frontend/src/hooks/useShareLink.ts": "Generates and copies a personalized share URL based on configured names, with toast feedback.",
  "frontend/src/index.css": "Defines global Tailwind layers, custom color variables, fonts, and animation utilities for the app theme.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/state/useLoveLetterConfig.ts": "Zustand store managing all love letter customization fields, selected template, and current section.",
  "frontend/src/state/usePhotoGallery.ts": "Zustand store for managing a photo gallery including adding, removing, updating captions, and active photo state.",
  "frontend/src/utils/shareQueryParams.ts": "Parses from/to query parameters and generates shareable URLs that embed these values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, shadows, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project goals, current feature set, issues, and architectural notes for the Valentine-style customizable webpage."
}